# ArrowFilled Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ArrowFilled Property
ParameterTypeId Class See Also
---
"Fill Tick"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ArrowFilled { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ArrowFilled As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ArrowFilled {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace